In [23]:
import pandas as pd

In [24]:
emp ={"name":['Nidhi','Ankit','Abhishek'],
     "Gender":["Female","Male","Male"],
     "Mail":["n@gail.com","ankit@gmail.com","abhishek@gmail.com"]
}

df = pd.DataFrame(emp)
df

       name  Gender                Mail
0     Nidhi  Female          n@gail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [25]:
#filtering in pandas
fc = (df["name"]=="Nidhi")
df[fc]

    name  Gender        Mail
0  Nidhi  Female  n@gail.com

In [29]:
fc = (df["name"]=="Nidhi")
df.loc[fc,'Gender']

0    Female
Name: Gender, dtype: object

In [46]:
df.iloc[0:2,1]

0    Female
1      Male
Name: Gender, dtype: object

In [39]:
df.index = [0,1,2]

In [40]:
df

       name  Gender                Mail
0     Nidhi  Female          n@gail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [41]:
df[fc]

    name  Gender        Mail
0  Nidhi  Female  n@gail.com

In [47]:
df

       name  Gender                Mail
0     Nidhi  Female          n@gail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [49]:
#fetch column names
df.columns

Index(['name', 'Gender', 'Mail'], dtype='object')

In [50]:
#rename coluns
df.columns = ['emp_name','gender','emp_mail']

In [51]:
df

   emp_name  gender            emp_mail
0     Nidhi  Female          n@gail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [57]:
#rename specific columns
df.rename(columns = {'emp_name':'name', 'emp_email':'email'},inplace=True)

In [58]:
df

       name  gender            emp_mail
0     Nidhi  Female          n@gail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [64]:
#updating complete row
df.loc[0] = ['Ankita','Female','ankita@gmail.com']

In [65]:
df

       name  gender            emp_mail
0    Ankita  Female    ankita@gmail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [66]:
#updating speicfic one column
df.loc[0,'name'] = 'Nidhi'

In [67]:
df

       name  gender            emp_mail
0     Nidhi  Female    ankita@gmail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [68]:
#updating speicfic more column
df.loc[0,['name','emp_mail']] = ['Nidhi','n@gmail.com']

In [69]:
df

       name  gender            emp_mail
0     Nidhi  Female         n@gmail.com
1     Ankit    Male     ankit@gmail.com
2  Abhishek    Male  abhishek@gmail.com

In [70]:
fc = (df['gender']=='Male')

In [71]:
fc

0    False
1     True
2     True
Name: gender, dtype: bool

In [72]:
df[fc]

       name gender            emp_mail
1     Ankit   Male     ankit@gmail.com
2  Abhishek   Male  abhishek@gmail.com

In [73]:
df.loc[fc,'gender'] ='Female'

In [74]:
df

       name  gender            emp_mail
0     Nidhi  Female         n@gmail.com
1     Ankit  Female     ankit@gmail.com
2  Abhishek  Female  abhishek@gmail.com

In [77]:
df.iloc[:,1]

0    Female
1    Female
2    Female
Name: gender, dtype: object

In [78]:
df

       name  gender            emp_mail
0     Nidhi  Female         n@gmail.com
1     Ankit  Female     ankit@gmail.com
2  Abhishek  Female  abhishek@gmail.com

In [79]:
df['name'].apply(len)

0    5
1    5
2    8
Name: name, dtype: int64

In [80]:
def update_email(email):
    return email.upper()

In [81]:
df['gender'].apply(update_email)

0    FEMALE
1    FEMALE
2    FEMALE
Name: gender, dtype: object

In [90]:
df

       name  gender            emp_mail
0     Nidhi  Female         n@gmail.com
1     Ankit  Female     ankit@gmail.com
2  Abhishek  Female  abhishek@gmail.com

In [91]:
#speicfic values apply
df['emp_mail'].apply(update_email)

0           N@GMAIL.COM
1       ANKIT@GMAIL.COM
2    ABHISHEK@GMAIL.COM
Name: emp_mail, dtype: object

In [83]:
df.applymap(len)

   name  gender  emp_mail
0     5       6        11
1     5       6        15
2     8       6        18

In [84]:
df.applymap(update_email)

       name  gender            emp_mail
0     NIDHI  FEMALE         N@GMAIL.COM
1     ANKIT  FEMALE     ANKIT@GMAIL.COM
2  ABHISHEK  FEMALE  ABHISHEK@GMAIL.COM

In [85]:
df

       name  gender            emp_mail
0     Nidhi  Female         n@gmail.com
1     Ankit  Female     ankit@gmail.com
2  Abhishek  Female  abhishek@gmail.com

In [97]:
#str method
df['name']=df['name'].str.upper()

In [99]:
df

       name  gender            emp_mail
0     NIDHI  Female         n@gmail.com
1     ANKIT  Female     ankit@gmail.com
2  ABHISHEK  Female  abhishek@gmail.com

In [100]:
df['name']=df['name'].str.lower()

In [101]:
df

       name  gender            emp_mail
0     nidhi  Female         n@gmail.com
1     ankit  Female     ankit@gmail.com
2  abhishek  Female  abhishek@gmail.com

In [102]:
df['name'].str.contains('a')

0    False
1     True
2     True
Name: name, dtype: bool

In [103]:
df['name'].str.startswith('a')

0    False
1     True
2     True
Name: name, dtype: bool

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      3 non-null      object
 1   gender    3 non-null      object
 2   emp_mail  3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [105]:
df

       name  gender            emp_mail
0     nidhi  Female         n@gmail.com
1     ankit  Female     ankit@gmail.com
2  abhishek  Female  abhishek@gmail.com

In [108]:
#adding new column
df['salary']=1000

In [109]:
df

       name  gender            emp_mail  salary
0     nidhi  Female         n@gmail.com    1000
1     ankit  Female     ankit@gmail.com    1000
2  abhishek  Female  abhishek@gmail.com    1000

In [110]:
#concatenate
df['name_gender'] = df['name'] + df['gender']

In [111]:
df

       name  gender            emp_mail  salary     name_gender
0     nidhi  Female         n@gmail.com    1000     nidhiFemale
1     ankit  Female     ankit@gmail.com    1000     ankitFemale
2  abhishek  Female  abhishek@gmail.com    1000  abhishekFemale

In [112]:
df['salary'] = 2000

In [113]:
df

       name  gender            emp_mail  salary     name_gender
0     nidhi  Female         n@gmail.com    2000     nidhiFemale
1     ankit  Female     ankit@gmail.com    2000     ankitFemale
2  abhishek  Female  abhishek@gmail.com    2000  abhishekFemale

In [116]:
#update specific row data
df.loc[(df['name']=='ankit'),'salary']=5000

In [117]:
df

       name  gender            emp_mail  salary     name_gender
0     nidhi  Female         n@gmail.com    2000     nidhiFemale
1     ankit  Female     ankit@gmail.com    5000     ankitFemale
2  abhishek  Female  abhishek@gmail.com    2000  abhishekFemale

In [118]:
df['salary']=[5000,6000,70000]

In [119]:
df

       name  gender            emp_mail  salary     name_gender
0     nidhi  Female         n@gmail.com    5000     nidhiFemale
1     ankit  Female     ankit@gmail.com    6000     ankitFemale
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale

In [122]:
#delete rows
df.drop(index=0)

       name  gender            emp_mail  salary     name_gender
1     ankit  Female     ankit@gmail.com    6000     ankitFemale
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale

In [123]:
df

       name  gender            emp_mail  salary     name_gender
0     nidhi  Female         n@gmail.com    5000     nidhiFemale
1     ankit  Female     ankit@gmail.com    6000     ankitFemale
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale

In [128]:
fc = (df['salary'] >= 5000)
fc

0    True
1    True
2    True
Name: salary, dtype: bool

In [129]:
df['salary1']=1200

In [130]:
df

       name  gender            emp_mail  salary     name_gender  salary1
0     nidhi  Female         n@gmail.com    5000     nidhiFemale     1200
1     ankit  Female     ankit@gmail.com    6000     ankitFemale     1200
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale     1200

In [132]:
df.drop(columns='salary1')

       name  gender            emp_mail  salary     name_gender
0     nidhi  Female         n@gmail.com    5000     nidhiFemale
1     ankit  Female     ankit@gmail.com    6000     ankitFemale
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale

In [133]:
df

       name  gender            emp_mail  salary     name_gender  salary1
0     nidhi  Female         n@gmail.com    5000     nidhiFemale     1200
1     ankit  Female     ankit@gmail.com    6000     ankitFemale     1200
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale     1200

In [134]:
df.sort_values('name')

       name  gender            emp_mail  salary     name_gender  salary1
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale     1200
1     ankit  Female     ankit@gmail.com    6000     ankitFemale     1200
0     nidhi  Female         n@gmail.com    5000     nidhiFemale     1200

In [135]:
df.sort_values('name',ascending=True)

       name  gender            emp_mail  salary     name_gender  salary1
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale     1200
1     ankit  Female     ankit@gmail.com    6000     ankitFemale     1200
0     nidhi  Female         n@gmail.com    5000     nidhiFemale     1200

In [136]:
df.sort_values('name',ascending=False)

       name  gender            emp_mail  salary     name_gender  salary1
0     nidhi  Female         n@gmail.com    5000     nidhiFemale     1200
1     ankit  Female     ankit@gmail.com    6000     ankitFemale     1200
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale     1200

In [138]:
df.sort_values(['gender','salary'],ascending =[False,True])

       name  gender            emp_mail  salary     name_gender  salary1
0     nidhi  Female         n@gmail.com    5000     nidhiFemale     1200
1     ankit  Female     ankit@gmail.com    6000     ankitFemale     1200
2  abhishek  Female  abhishek@gmail.com   70000  abhishekFemale     1200